'use strict';

const ErrorMessages = require('../error_messages/ErrorMessages');
const BmApiError = ErrorMessages.BmApiError;

function Search(client) {
    this.get = client.get;
}

const URL = '/search';

Search.prototype = {

    /**
     * ✅ История поиска по товарам.
     * 🔗 https://developer.bm.parts/api/v2/search_products.html#get-search-products-history
     * * Query Parameters (options = {}):
     * ==============================================================================
     * |_____KEY____________|||_isRequired_|||__default___|||__description_
     * ==============================================================================
     * ------------------------------------------------------------------------------
     * ==============================================================================
     *
     */
    history: function () {
        return this.get(`${URL}/products/history`);
    },

    /**
     * ✅ Предложения поиска.
     * 🔗 https://developer.bm.parts/api/v2/search_products.html#get-search-products-suggest
     * * Query Parameters (options = {}):
     * ==============================================================================
     * |_____KEY____________|||_isRequired_|||__default___|||__description_
     * ==============================================================================
     * | q                   | true         |              | Поисковая фраза. Например &q=115 906 или &q=амортизатор передний
     * ------------------------------------------------------------------------------
     * | products_as         | false        |   obj        | Возвращаемый формат товаров. Возможные варианты: obj, arr
     * ------------------------------------------------------------------------------
     * ==============================================================================
     *
     */
    suggestProducts: function (options) {
        const statusError = BmApiError({
            inputOptions: options,
            requireParameters: ['q'],
            url: {
                base: 'search_products',
                hash: 'get-search-products-suggest'
            }
        });
        if (!statusError)
            return this.get(`${URL}/products/suggest`, {products_as: 'obj', ...options});
    },

    /**
     * ✅ Предложения поиска.
     * 🔗 https://developer.bm.parts/api/v2/search_products.html#get-search-suggests
     * * Query Parameters (options = {}):
     * ==============================================================================
     * |_____KEY____________|||_isRequired_|||__default___|||__description_
     * ==============================================================================
     * | q                   | true         |              | Поисковая фраза. Например &q=115 906 или &q=амортизатор передний
     * ------------------------------------------------------------------------------
     * | products_as         | false        |   obj        | Возвращаемый формат товаров. Возможные варианты: obj, arr
     * ------------------------------------------------------------------------------
     * ==============================================================================
     *
     * В ответе доступно JSON ключ type который может принимать значения vehicle или products.
     */
    searchSuggests: function (options) {
        const statusError = BmApiError({
            inputOptions: options,
            requireParameters: ['q'],
            url: {
                base: 'search_products',
                hash: 'get-search-suggests'
            }
        });
        if (!statusError)
            return this.get(`${URL}/suggests`, {products_as: 'obj', ...options});
    },

    /***
     * Поиск товаров по каталогу
     * https://developer.bm.parts/api/v2/search_products.html#get-search-products
     *
     * * * Query Parameters (options = {}):
     * ==============================================================================
     * |_____KEY____________|||_isRequired_|||__default___|||__description_
     * ==============================================================================
     * |   q                 |   false      |              | Поисковая фраза. Например &q=115 906 или &q=амортизатор передний
     * -----------------------------------------------------------------------------------------------------------------
     * |   brands            |   false      |              | Указание по каким брендам выполнять фильтрацию: &brands=SOLGY&brands=SACHS
     * -----------------------------------------------------------------------------------------------------------------
     * |   nodes             |   false      |              | Фильтрация по сборочному узлу: &nodes=Легковые автомобили/Подвеска.
     * -----------------------------------------------------------------------------------------------------------------
     * |   new_arrival       |   false      |              | Фильтр по новому поступлению, необходимо передать ID нового поступления.
     * -----------------------------------------------------------------------------------------------------------------
     * |   advertisement     |   false      |              | Фильтр по рекламным акциям, необходимо передать ID рекламной акции
     * -----------------------------------------------------------------------------------------------------------------
     * |   cars              |   false      |              | Фильтр по автомобилям, например &cars=BMW&cars=MERCEDES-BENZ>SPRINTER 2-t.
     * -----------------------------------------------------------------------------------------------------------------
     * |   new_product       |   false      |              |  Показывать только новые товары, примает 1 или 0.
     * |                     |              |              |  По умолчанию - показывать все товары.
     * -----------------------------------------------------------------------------------------------------------------
     * |   promo             |   false      |              |  Показывать только акционные товары, примает 1 или 0.
     * |                     |              |              |  По умолчанию - показывать все товары.
     * -----------------------------------------------------------------------------------------------------------------
     * |   warehouses        |   false      |              |  ID складов по которым возвращать остатки:
     * |                     |              |              |  &warehouses=816D000C2999A7E611E6EC6B4A1915AF&warehouses=ACF9000C2947F7AE11E28A2B02C4AD32.
     * |                     |              |              |  По умолчанию - возвращает остатки для основного склада.
     * -----------------------------------------------------------------------------------------------------------------
     * |   currency          |   false      |              |  Валюта в которой возвращать цены из товаров.
     * |                     |              |              |  По умолчанию - валюта договора.
     * -----------------------------------------------------------------------------------------------------------------
     * ==============================================================================
     *
     * @param options
     * @returns {*}
     */
    products: function (options) {
        return this.get(`${URL}/products`, {...options})
    },

};

module.exports = Search;
